docs/notes/perception-of-right-and-wrong.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Perception of Right and Wrong</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a> | <a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<h1 class="title">Perception of Right and Wrong</h1>
<p>
Our company bus driver drives very rashly. Speed limits on roadside boards mean nothing to him. Even in moderate traffic, I do not remember the horn being silent for more than 20 seconds. He keeps pressing it without considering that the person ahead is also in a hurry and also has somewhere to reach.
</p>

<p>
One day, while getting off the bus, I asked him, "Kyon itna horn bajate ho bhai" (brother, why do you honk so much). He smiled innocently and said, "Sir horn nahin bajaenge to koi side nahin dega" (Sir, if I don't blow the horn then no one will give us way). The next day, he drove exactly the same way.
</p>

<p>
I thought about it later and realized there is nothing fundamentally wrong with the driver. He grew up in surroundings where no one told him this was wrong. For him, honking is simply how you drive. His perception of right and wrong, in this small matter, was shaped by everything around him.
</p>

<p>
We have all seen someone doing something clearly wrong, and wondered why they do not see it. Even if you point it out, they will not accept it. They genuinely believe they are doing right. That is perception at work. It is not about intelligence or intent. It is about what you grew up seeing as normal.
</p>

<p>
This is true at every scale. In terrorist camps, young people are trained by reshaping exactly this sense of right and wrong. They are brainwashed until they do not feel sorry while killing someone. The mechanism is the same as our driver's case, only the stakes are incomparably higher.
</p>

<p>
It shows up in smaller ways at work too. In a meeting room, sometimes we have a better design right in front of us, and yet we stick to what we proposed. We try to prove our version is superior even when it is not. Here, ego plays a bigger role than perception, but the result is similar. We end up defending what feels right to us rather than what actually is.
</p>

<p>
We have millions of cells in our brain working together to help us judge right and wrong. What surrounds us shapes how those cells respond. Surrounding ourselves with good influences and honest feedback could make us better at telling the difference.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./the-grand-weightloss-party.html">&larr; Newer: The Grand Weight Loss Party</a><a class="older" href="./vashi-days-of-ncst.html">Older: Vashi Days of NCST &rarr;</a></nav><p class="date">Published: 2007-08-17</p><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
